Enums/упПоказателиРаспределенияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упПоказателиРаспределенияРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Время</Name>
					<Comment>Время от начала погрузки до окончания разгрузки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Расстояние между точками погрузки и разгрузки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Масса</Name>
					<Comment>Масса перевезенного товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объем</Name>
					<Comment>Объем перевезенного товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоМест</Name>
					<Comment>Количество перевезенных грузовых мест</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Comment>Количество загрузочных метров занятых перевезенным грузом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановыеРасходыПоРейсу</Name>
					<Comment>Плановые расходы связанные с перевозкой груза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочнаяСтоимостьГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическиеРасходыПоРейсу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упПоказателиРаспределенияРасходов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СписокИсключений = Новый СписокЗначений;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьМассу") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.Масса);
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьОбъем") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.Объем);
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.КоличествоМест);
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоЗагрузочныхМетров") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.КоличествоЗагрузочныхМетров);
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упПоказателиРаспределенияРасходов.Ссылка
	|ИЗ
	|	Перечисление.упПоказателиРаспределенияРасходов КАК упПоказателиРаспределенияРасходов
	|ГДЕ
	|	НЕ упПоказателиРаспределенияРасходов.Ссылка В(&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	упПоказателиРаспределенияРасходов.Порядок";
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
